{
  "countries": [
    {
      "id": 1,
      "name": "Australia",
      "cities": [
        {
          "name": "Sydney, Australia",
          "imageUrl": "images/sydney.jpg",
          "description": "A vibrant city famous for its iconic landmarks like the Sydney Opera House and Sydney Harbour Bridge, bustling waterfronts, beautiful beaches, and lively cultural scene."
        },
        {
          "name": "Melbourne, Australia",
          "imageUrl": "images/melbourne.jpg",
          "description": "A vibrant cultural hub known for its world-class art scene, diverse neighborhoods, trendy cafes, delicious food, and lively events year-round."
        }
      ]
    },
    {
      "id": 2,
      "name": "Japan",
      "cities": [
        {
          "name": "Tokyo, Japan",
          "imageUrl": "images/tokyo.jpg",
          "description": "A bustling metropolis where ancient traditions meet cutting-edge modernity, featuring stunning temples, vibrant neighborhoods, delicious cuisine, cherry blossoms in spring, and endless cultural experiences."
        },
        {
          "name": "Kyoto, Japan",
          "imageUrl": "images/kyoto.jpg",
          "description": "A city of timeless beauty, famous for its historic temples, serene gardens, traditional tea houses, geisha districts, and seasonal cherry blossoms that capture the essence of Japanese culture."
        }
      ]
    },
    {
      "id": 3,
      "name": "Brazil",
      "cities": [
        {
          "name": "Rio de Janeiro, Brazil",
          "imageUrl": "images/janeiro.jpg",
          "description": "A lively city known for its stunning beaches, vibrant carnival celebrations, and iconic landmarks."
        },
        {
          "name": "São Paulo, Brazil",
          "imageUrl": "images/paulo.jpg",
          "description": "The financial hub with diverse culture, arts, and a vibrant nightlife."
        }
      ]
    }
  ],
  "temples": [
    {
      "name": "Angkor Wat, Cambodia",
      "imageUrl": "images/angkor.jpg",
      "description": "An ancient temple complex and UNESCO World Heritage site."
    },
    {
      "id": 2,
      "name": "Taj Mahal, India",
      "imageUrl": "images/taj.jpg",
      "description": "An iconic symbol of love and a masterpiece of Mughal architecture."
    }
  ],
  "beaches": [
    {
      "id": 1,
      "name": "Bora Bora, French Polynesia",
      "imageUrl": "images/bora.jpg",
      "description": "An island known for its stunning turquoise waters and luxurious overwater bungalows."
    },
    {
      "id": 2,
      "name": "Copacabana Beach, Brazil",
      "imageUrl": "images/copacabana.jpg",
      "description": "A famous beach in Rio de Janeiro, Brazil, with a vibrant atmosphere and scenic views."
    }
  ]
}
